[{"id":70,"localtime":"2017-08-10 19:27:00","message":"Closing Ceremony WSDC 2017 live streaming at http://tve.kemdikbud.go.id"},{"id":69,"localtime":"2017-08-10 17:45:00","message":"The Champion of WSDC 2017 is Singapore. CONGRATULATION!"},{"id":68,"localtime":"2017-08-10 15:13:00","message":"Watch the grand final round of WSDC 2017 Bali between Singapore vs England live at tve.kemdikbud.go.id, 15.00 PM (UTC+8.00)."},{"id":67,"localtime":"2017-08-10 15:09:00","message":"GF motion: This House supports restrictions on free speech to combat the rise of right-wing populism."},{"id":66,"localtime":"2017-08-10 13:02:00","message":"Mlungisi Dlamini, Jana Gilke, Kevin Moar, Ameera Natasha Moore, Julio Meyer, Karin Merckens, Yoni Cohen-Idov."},{"id":65,"localtime":"2017-08-10 13:01:00","message":"Congratulations for the following panelists, who will be judging today's WSDC 2017 Grand Final alongside Kip Oebanda and Aisha Ahmad:"},{"id":64,"localtime":"2017-08-10 08:51:00","message":"The Tournament Committee Meeting will take place in Tabanan room, 4th floor at 9 AM."},{"id":63,"localtime":"2017-08-09 14:56:00","message":"Motion for SF: TH Prefers a benevolent dictatorship over a weak democracy."},{"id":62,"localtime":"2017-08-09 10:38:00","message":"Motion for the Quarterfinals: THW impose additional taxes on employers who use automation to replace human workers."},{"id":61,"localtime":"2017-08-09 07:32:00","message":"Julio, Theodore, Sharukh, Ameera, Karin, Jesus, Fil, Lisa, Ashish, James Stratton, Luis, Mark Gabriel, Agrim. (2/2)"},{"id":60,"localtime":"2017-08-09 07:31:00","message":"Aisha, Kip, Lunga, Tamara, Jana, George, Scott, Yoni, Dena, Tasneem, Milky, Joshua, Alif, Kevin Moar, Menno. (1/2)"},{"id":59,"localtime":"2017-08-09 07:30:00","message":"List of judges for Quarter Finals \u0026 Semi Finals:"},{"id":58,"localtime":"2017-08-08 14:37:00","message":"Motion for OF: THW Supports Military Retaliation Against Cyber Attacks."},{"id":57,"localtime":"2017-08-08 10:20:00","message":"Motion for PDO: THW Legalize Surrogate Motherhood For Profit."},{"id":53,"localtime":"2017-08-08 08:40:00","message":"All teams competing in PDOs please be ready by 9 AM at the ballroom for departure to the venue."},{"id":56,"localtime":"2017-08-08 00:34:00","message":"Other participants wishing to watch the PDOs and/or Octofinals may choose to leave with either group of buses at 9 AM or 12.30 PM."},{"id":55,"localtime":"2017-08-08 00:33:00","message":"All breaking judges must leave with the morning buses leaving at 9 AM."},{"id":54,"localtime":"2017-08-08 00:32:00","message":"All teams competing in Octofinals may choose to leave for the venue at 9 AM or 12.30 PM."},{"id":52,"localtime":"2017-08-07 13:49:00","message":"THBT states should be able to prioritize asylum seekers on the basis of cultural similarity with the existing population."},{"id":51,"localtime":"2017-08-07 13:48:00","message":"Motion for preliminary round 8:"},{"id":50,"localtime":"2017-08-07 10:31:00","message":"THBT The NATO Enhanced Forward Presence in Eastern Europe does more harm than good."},{"id":49,"localtime":"2017-08-06 18:54:00","message":"All team managers please come to TCE Meeting at Denpasar Room 3rd Floor 7.30 PM."},{"id":48,"localtime":"2017-08-06 13:37:00","message":"Round 6: THBT when working to preserve rare and endangered species, private entities are more effective than the state."},{"id":47,"localtime":"2017-08-06 08:10:00","message":"There are some important updates related to today's matches. Please refer to the board in front of the ball room."},{"id":46,"localtime":"2017-08-05 14:40:00","message":"Don't forget to post your WSDC 2017 experiences in Instagram and find us at @wsdc2017bali."},{"id":45,"localtime":"2017-08-04 14:46:00","message":"All judges please fill in your ADJUDICATION BALLOT correctly."},{"id":44,"localtime":"2017-08-04 14:45:00","message":"Please do not forget to submit your feedback forms (judge to judge and coach to judge)."},{"id":43,"localtime":"2017-08-04 14:02:00","message":"THBT states should not erect statues or memorials which commemorate or glorify military campaigns or the service of soldiers in war."},{"id":42,"localtime":"2017-08-04 14:01:00","message":"The motion for preliminary round 4 is:"},{"id":39,"localtime":"2017-08-04 08:19:00","message":"There are some important updates related to today's matches. Please refer to the board in front of the ball room."},{"id":38,"localtime":"2017-08-03 08:57:00","message":"Bus 1 to 8 will head to SMA 1, bus 9-16 will head to SMA 7. Please follow your LO's instructions."},{"id":37,"localtime":"2017-08-03 08:56:00","message":"There has been an update of the judges pairing for Round 1 and Round 2. Please refer to the board in front of the ballroom."},{"id":36,"localtime":"2017-08-02 19:47:00","message":"Stream the Opening Ceremony of WSDC 2017 in Bali, Indonesia on tve.kemdikbud.go.id!"},{"id":35,"localtime":"2017-08-02 14:04:00","message":"First bus for opening ceremony will leave at 4.30 from the main lobby. The last bus will leave at 5.30. Please follow your LO instruction."},{"id":34,"localtime":"2017-08-02 13:00:00","message":"Please come to the TEAM MANAGERS MEETING at 4.00 PM in Denpasar Room, 3rd Floor."},{"id":33,"localtime":"2017-08-02 11:32:00","message":"Ghana and Tunisia have confirmed that they are withdrawing from WSDC 2017."},{"id":2,"localtime":"2017-08-01 09:00:00","message":"Welcome to Bali! If you need any assistance, please find contact information from the Info section of this app."}]